[
    {
      "text": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете",
      "author": "Стив Макконнелл"
    },
    {
      "text": "Сложность программы растет до тех пор, пока не превысит способности программиста",
      "author": "Артур Блох. Законы Мэрфи"
    },
      {
      "text": "Ходить по воде и разрабатывать программы, следуя ТЗ, очень просто… если они заморожены",
      "author": "И. Берард"
    },
    {
        "text": "Интуиция — очень мощная штука, более мощная, чем интеллект",
        "author": "Стив Джобс"  
    },
    {
        "text": "Моя работа — не облегчать жизнь людям. Моя работа — делать их лучше",
        "author": "Стив Джобс"  
    },
    {
        "text": "Наиболее важные решения — это не то, что вы делаете, а то, что вы решили не делать",
        "author": "Стив Джобс"  
    },
    {
        "text": "Сделай вид, будто контролируешь ситуацию, и люди в это поверят.",
        "author": "Стив Джобс"  
    },
    {
        "text": "В хорошем дизайне добавление чего-то стоит дешевле, чем сама эта вещь",
        "author": "Thomas C. Gale"  
    },
    {
        "text": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода",
        "author": "Christopher Thompson"  
    },
    {
        "text": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу",
        "author": "Bill Gates"  
    },
    {
        "text": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня",
        "author": "Larry Wall"  
    },
    {
        "text": "Программы должны писаться для людей, которые будут их читать, а машины, которые будут эти программы исполнять — второстепенны",
        "author": "Harold Abelson"  
    },
    {
        "text": "Люди, которые думают, что ненавидят компьютеры, на самом деле ненавидят плохих программистов",
        "author": "Larry Niven"  
    },
    {
        "text": "Если вы дадите человеку программу, то займете его на один день. Если вы научите человека программировать, то займете его на всю жизнь",
        "author": "Waseem Latif"  
    },
    {
        "text": "Язык, который не меняет вашего представления о программировании, недостоин изучения",
        "author": "Alan J. Perlis"  
    },
    {
        "text": "Иногда лучшие программы создаются на бумажке. Запрограммировать их — второстепенная вещь",
        "author": "Max Kanat-Alexander"  
    },
    {
        "text": "Программирование — это сложно. Основные правила, на которых все строится, очень просты, но по мере разработки программа сама начинает вводить свои правила и законы. Таким образом, программист строит лабиринт, в котором сам же может и потеряться",
        "author": "Marijn Haverbeke"  
    },
    {
        "text": "Простота — залог надежности",
        "author": "Edsger W. Dijkstra"  
    },
    {
        "text": "Работает? Не трогай",
        "author": "Любой программист"  
    },
    {
        "text": "Молодые специалисты не умеют работать, а опытные специалисты умеют не работать",
        "author": "Alexander Golov"  
    },
    {
        "text": "Почаще задавайте себе вопрос «Что мне скрыть?» и вы удивитесь, сколько проблем проектирования растает на ваших глазах",
        "author": "C. MacConnell"  
    },
    {
        "text": "Чтобы написать чистый код, мы сначала пишем грязный код, а затем рефакторим его",
        "author": "Robert Martin"  
    },
    {
        "text": "Для каждой сложной задачи существует решение, которое является быстрым, простым и неправильным",
        "author": "H. L. Mencken"  
    },
    {
        "text": "Нельзя доверять коду, который вы не написали полностью сами",
        "author": "Ken Thompson"  
    }
  ]  